* Librerías a utilizar

In [1]:
import mysql.connector as con
import pandas as pd
import random
import datetime
import pymysql
import sqlalchemy
from sqlalchemy import create_engine
from datetime import datetime, timedelta

print(con.__version__)

9.1.0

##### 1. Crear base de datos

- Crear con código SQL una base de datos llamada supermercado
- Crear 7 tablas

        tiendas

    id_tienda (CLAVE PRIMARIA)
    nombre_tienda
    direccion
    ciudad

        empleados

    id_empleado (CLAVE PRIMARIA)
    nombre_empleado
    puesto (ej.: Cajero, Gerente, Reponedor)
    id_tienda (CLAVE EXTRANJERA que hace referencia a tiendas.id_tienda)

        categorías

    id_categoria (CLAVE PRIMARIA)
    nombre_categoria

        productos

    id_producto (CLAVE PRIMARIA)
    nombre_producto
    precio
    existencias
    id_categoria (CLAVE EXTRANJERA que hace referencia a categorias.id_categoria)

        clientes

    id_cliente (CLAVE PRIMARIA)
    nombre de pila
    apellido
    correo electrónico
    codigo_postal

        órdenes

    id_orden (CLAVE PRIMARIA)
    id_cliente (CLAVE EXTRANJERA que hace referencia a clientes.id_cliente)
    id_empleado (CLAVE EXTRANJERA que hace referencia a empleados.id_empleado)
    fecha_orden
    metodo_pago (una enumeración que solo admite tres valores Tarjeta, Efectivo)

        detalle_orden

    id_detalle (CLAVE PRIMARIA)
    id_orden (CLAVE EXTRANJERA que hace referencia a ordenes.id_orden) NOT NULL
    id_producto (CLAVE EXTRANJERA que hace referencia a productos.id_producto) NOT NULL
    cantidad
    precio_unitario: mismo precio que en la tabla producto
    descuento (podría ser NULL si no se aplica)

In [2]:
sql = """
DROP DATABASE IF EXISTS supermercado;

CREATE DATABASE IF NOT EXISTS supermercado;

USE supermercado;

CREATE TABLE IF NOT EXISTS tiendas (
    id_tienda INT AUTO_INCREMENT PRIMARY KEY,
    nombre_tienda VARCHAR(100),
    direccion VARCHAR(100),
    ciudad VARCHAR(100)
);
CREATE TABLE IF NOT EXISTS empleados (
    id_empleado INT AUTO_INCREMENT PRIMARY KEY,
    nombre_empleado VARCHAR(100),
    puesto VARCHAR(100),
    id_tienda INT NOT NULL,
    FOREIGN KEY (id_tienda) REFERENCE tiendas (id_tienda)
);
CREATE TABLE IF NOT EXISTS categorias (
    id_categoria INT AUTO_INCREMENT PRIMARY KEY,
    nombre_categoria VARCHAR(100),
);
CREATE TABLE IF NOT EXISTS productos (
    id_producto INT AUTO_INCREMENT PRIMARY KEY,
    nombre_producto VARCHAR(100),
    precio DECIMAL (5, 2),
    existencias INT,
    id_categoria INT NOT NULL,
    FOREIGN KEY (id_categoria) REFERENCE categorias (id_categoria)
);
CREATE TABLE IF NOT EXISTS clientes (
    id_cliente INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100),
    email VARCHAR(100),
    codigo_postal INT
);
CREATE TABLE IF NOT EXISTS ordenes (
    id_orden INT AUTO_INCREMENT PRIMARY KEY,
    id_cliente INT NOT NULL,
    id_empleado INT NOT NULL,
    fecha_orden DATETIME,
    metodo_pago ENUM(Tarjeta, Efectivo),
    FOREIGN KEY (id_cliente) REFERENCE clientes (id_cliente),
    FOREIGN KEY (id_empleado) REFERENCE empleados (id_empleado)
);
CREATE TABLE IF NOT EXISTS detalle_orden (
    id_detalle INT AUTO_INCREMENT PRIMARY KEY,
    id_orden INT NOT NULL,
    id_producto INT NOT NULL,
    cantidad INT,
    precio_unitario DECIMAL (5, 2),
    descuento DECIMAL (3, 2),
    FOREIGN KEY (id_orden) REFERENCE ordenes (id_orden),
    FOREIGN KEY (id_producto) REFERENCE productos (id_producto)
);     
"""

- Código Python con conector mysql que ejecuta el SQL para borrar y generar la base de datos vacía

In [3]:
connection = con.connect(
    host='localhost',
    port='3306',
    user='root',
    password='admin'
)

cursor = connection.cursor()
cursor.execute(sql)
cursor.close()
connection.close()

##### 2. Generar datos de demostración desde Python

- Generar datos aleatorios en listas con Python similares a los realizados en clase.

   Uso de datetime, timedelta, random para generar datos aleatorios

- Pasar los datos a DataFrames de Pandas

- Pasar los DataFrames de Pandas a MySQL usando la función to_sql de Pandas con SQLAlchemy o usando MySQL Connector con sentencias INSERT.

TABLA TIENDAS

In [4]:
tiendas = ["Super1", "Super2", "Super3", "Super4", "Super5", "Super6", "Super7", "Super8"]
direccion = ["Calle Vicente Ferrer, Nº21", "Plaza Einstein, Nº6", "Calle Parras, Nº15", "Calle Linares, Nº12", "Plaza Constitución, Nº29", "Avenida Europa, Nº18", "Avenida Deportes, Nº11", "Calle Elvira, Nº30"]
ciudad = ["Jaén", "Granada", "Málaga", "Almería", "Sevilla", "Córdoba", "Cádiz", "Huelva"]

df_tiendas = pd.DataFrame(zip(tiendas, direccion, ciudad), columns=["nombre_tienda", "direccion", "ciudad"])

df_tiendas = df_tiendas.reset_index().rename({'index': 'id_tienda'}, axis=1)
df_tiendas['id_tienda'] = df_tiendas['id_tienda'] + 1
df_tiendas

   id_tienda nombre_tienda                   direccion   ciudad
0          1        Super1  Calle Vicente Ferrer, Nº21     Jaén
1          2        Super2         Plaza Einstein, Nº6  Granada
2          3        Super3          Calle Parras, Nº15   Málaga
3          4        Super4         Calle Linares, Nº12  Almería
4          5        Super5    Plaza Constitución, Nº29  Sevilla
5          6        Super6        Avenida Europa, Nº18  Córdoba
6          7        Super7      Avenida Deportes, Nº11    Cádiz
7          8        Super8          Calle Elvira, Nº30   Huelva

TABLA EMPLEADOS

In [5]:
nombres = ["Carmen", "Manuel", "Fátima", "Marcos", "Noelia", "Hugo", "Rocío", "Javier", "Lucía", "Antonio", "María", "Francisco", "Carmela", "Izan", "Natalia", "Daniel", "Mónica", "Carlos", "Rosa", "Diego"]
apellidos = ["Barranco", "Cazalla", "Mantas", "García", "Ortega", "Pérez", "Estévez", "Ramírez", "Armenteros", "Cámara","Anguita", "Arjona", "Arroyo", "Liébana", "López", "Montijano", "Damas", "González", "Montiel", "Morillas" ]
puestos = ["Gerente", "Cajero", "Reponedor", "Vendedor", "Limpieza"]
empleados = list()

def dist_puesto(num, puestos):
    if num < 5:
        return puestos [1]
    if num < 10:
        return puestos [2]
    if num < 15:
        return puestos [3]
    if num < 19:
        return puestos [4]
    else:
        return puestos [0]

for tienda in tiendas:
    for num in range(20):
       nombre = f"{random.choice(nombres)} {random.choice(apellidos)}"
       puesto = dist_puesto(num, puestos) 
       empleados.append([nombre, puesto, tienda])
       
df_empleados = pd.DataFrame(empleados, columns=["nombre_empleado", "puesto", "id_tienda"])
df_empleados = df_empleados.reset_index().rename({'index': 'id_empleado'}, axis=1)
df_empleados['id_empleado'] = df_empleados['id_empleado'] + 1
df_empleados

     id_empleado   nombre_empleado    puesto id_tienda
0              1    Antonio Cámara    Cajero    Super1
1              2  Natalia Barranco    Cajero    Super1
2              3    Rocío González    Cajero    Super1
3              4     Antonio López    Cajero    Super1
4              5      Rosa Montiel    Cajero    Super1
..           ...               ...       ...       ...
155          156   Carlos Morillas  Limpieza    Super8
156          157     Izan Morillas  Limpieza    Super8
157          158     Hugo Morillas  Limpieza    Super8
158          159       Lucía Pérez  Limpieza    Super8
159          160    Carmela García   Gerente    Super8

[160 rows x 4 columns]

TABLA CATEGORÍAS

In [6]:
categorias = ["Pescadería","Frutería","Carnicería","Droguería","Lácteos","Bebidas","Charcutería","Aperitivos","Congelados","Panadería"]

df_categorias = pd.DataFrame(categorias, columns=["nombre_categoria"])
df_categorias = df_categorias.reset_index().rename({'index': 'id_categoria'}, axis=1)
df_categorias['id_categoria'] = df_categorias['id_categoria'] + 1
df_categorias

   id_categoria nombre_categoria
0             1       Pescadería
1             2         Frutería
2             3       Carnicería
3             4        Droguería
4             5          Lácteos
5             6          Bebidas
6             7      Charcutería
7             8       Aperitivos
8             9       Congelados
9            10        Panadería

TABLA PRODUCTOS

In [7]:
productos = {
    1: ["Bacalao", "Salmón", "Trucha", "Calamares"],
    2: ["Plátanos", "Mandarinas", "Manzanas", "Tomates"],
    3: ["Pollo", "Ternera", "Cerdo", "Pavo"],
    4: ["Lejía", "Ambientador", "Balleta", "Lavaplatos"],
    5: ["Leche", "Yogur", "Margarina", "Queso"],
    6: ["Refresco", "Agua", "Zumos", "Vino"],
    7: ["Choped", "Salchichón", "Jamón", "Lomo"],
    8: ["Aceitunas", "Patatas", "Almendras", "Avellanas"],
    9: ["Verdura", "Arroz", "Cubitos", "Helados"],
    10: ["Pan", "Donuts", "Ensaimada", "Napolitana"]
}

producto_terminado = []
for categoria in df_categorias["id_categoria"]:
    for producto in productos[categoria]:
        precio = round(random.uniform(0.50, 20.00), 2)
        existencias = random.randint(0, 500)
        producto_terminado.append([producto, precio, existencias, categoria])

df_productos = pd.DataFrame(producto_terminado, columns=["nombre_producto", "precio", "existencias", "id_categoria"])
df_productos = df_productos.reset_index().rename({'index': 'id_producto'}, axis=1)
df_productos['id_producto'] = df_productos['id_producto'] + 1
df_productos

    id_producto nombre_producto  precio  existencias  id_categoria
0             1         Bacalao    2.65          178             1
1             2          Salmón   16.16          439             1
2             3          Trucha   12.62          412             1
3             4       Calamares    8.59          103             1
4             5        Plátanos    5.01          423             2
5             6      Mandarinas   10.71          209             2
6             7        Manzanas    6.65          200             2
7             8         Tomates   14.69           61             2
8             9           Pollo   13.51          462             3
9            10         Ternera    9.66          298             3
10           11           Cerdo   18.69          308             3
11           12            Pavo    2.85            4             3
12           13           Lejía    9.27          175             4
13           14     Ambientador    8.16          290             4
14           15         Balleta   11.45          257             4
15           16      Lavaplatos    5.85          247             4
16           17           Leche   12.70           75             5
17           18           Yogur   16.80          373             5
18           19       Margarina    9.61           54             5
19           20           Queso   17.22           76             5
20           21        Refresco    1.43           59             6
21           22            Agua    7.93          212             6
22           23           Zumos   18.06          412             6
23           24            Vino   16.76           58             6
24           25          Choped    8.75          323             7
25           26      Salchichón   15.26          499             7
26           27           Jamón    4.52          299             7
27           28            Lomo    3.94          398             7
28           29       Aceitunas    7.82          216             8
29           30         Patatas   14.67          114             8
30           31       Almendras    0.78           84             8
31           32       Avellanas   16.93          248             8
32           33         Verdura   13.49           92             9
33           34           Arroz   10.84          320             9
34           35         Cubitos    5.81          103             9
35           36         Helados    5.66          357             9
36           37             Pan    3.93          384            10
37           38          Donuts   11.23          455            10
38           39       Ensaimada   19.44          415            10
39           40      Napolitana    5.25          345            10

TABLA CLIENTES

In [8]:
nombres = ["Carmen", "Manuel", "Fátima", "Marcos", "Noelia", "Hugo", "Rocío", "Javier", "Lucía", "Antonio", "María", "Francisco", "Carmela", "Izan", "Natalia", "Daniel", "Mónica", "Carlos", "Rosa", "Diego"]
apellidos = ["Barranco", "Cazalla", "Mantas", "García", "Ortega", "Pérez", "Estévez", "Ramírez", "Armenteros", "Cámara","Anguita", "Arjona", "Arroyo", "Liébana", "López", "Montijano", "Damas", "González", "Montiel", "Morillas" ]
emails = ["@gmail.com", "@hotmail.com", "@outlook.com"]

cliente = []

for num in range(2000):
    nombre = f"{random.choice(nombres)}"
    apellido = f"{random.choice(apellidos)}"
    email = f"{nombre}{apellido}{emails}"
    codigo_postal = random.randint(23000, 24000)
    cliente.append([nombre, apellido, email, codigo_postal])
   
df_clientes = pd.DataFrame(cliente, columns=["first_name", "last_name", "email", "codigo_postal"])
df_clientes = df_clientes.reset_index().rename({'index': 'id_cliente'}, axis=1)
df_clientes['id_cliente'] = df_clientes['id_cliente'] + 1
df_clientes

,id_cliente,first_name,last_name,email,codigo_postal
0,1,Natalia,González,"NataliaGonzález['@gmail.com', '@hotmail.com', ...",23109
1,2,Carlos,Anguita,"CarlosAnguita['@gmail.com', '@hotmail.com', '@...",23869
2,3,Carlos,Cámara,"CarlosCámara['@gmail.com', '@hotmail.com', '@o...",23450
3,4,Carmela,Mantas,"CarmelaMantas['@gmail.com', '@hotmail.com', '@...",23883
4,5,Antonio,López,"AntonioLópez['@gmail.com', '@hotmail.com', '@o...",23538
...,...,...,...,...,...
1995,1996,Izan,Ortega,"IzanOrtega['@gmail.com', '@hotmail.com', '@out...",23309
1996,1997,Diego,Ortega,"DiegoOrtega['@gmail.com', '@hotmail.com', '@ou...",23570
1997,1998,Mónica,Anguita,"MónicaAnguita['@gmail.com', '@hotmail.com', '@...",23003
1998,1999,Carmela,Cazalla,"CarmelaCazalla['@gmail.com', '@hotmail.com', '...",23125
1999,2000,Antonio,Arroyo,"AntonioArroyo['@gmail.com', '@hotmail.com', '@...",23101

TABLA ÓRDENES

In [9]:
clientes = df_clientes["id_cliente"]
empleados = df_empleados["id_empleado"]
fecha_apertura = datetime(year=2020, month=1, day=7, hour=9, minute=30)

ordenes = []
for orden in range (10000):
    cliente = int(random.choice(clientes))
    empleado = int(random.choice(empleados))
    pago = random.choice(["Tarjeta", "Efectivo"])
    fecha = fecha_apertura + timedelta(minutes=10*orden)
    ordenes.append([cliente, empleado,fecha, pago])
    
df_ordenes = pd.DataFrame(ordenes, columns=["id_cliente", "id_empleado", "fecha_orden", "metodo_pago"])
df_ordenes = df_ordenes.reset_index().rename({'index': "id_orden"}, axis=1)
df_ordenes['id_orden'] = df_ordenes['id_orden'] + 1
df_ordenes

      id_orden  id_cliente  id_empleado         fecha_orden metodo_pago
0            1        1242            9 2020-01-07 09:30:00     Tarjeta
1            2        1837           27 2020-01-07 09:40:00     Tarjeta
2            3         679          109 2020-01-07 09:50:00    Efectivo
3            4        1163           63 2020-01-07 10:00:00     Tarjeta
4            5         756           67 2020-01-07 10:10:00     Tarjeta
...        ...         ...          ...                 ...         ...
9995      9996         161           60 2020-03-16 19:20:00    Efectivo
9996      9997        1316           77 2020-03-16 19:30:00    Efectivo
9997      9998         543           35 2020-03-16 19:40:00     Tarjeta
9998      9999         914           19 2020-03-16 19:50:00    Efectivo
9999     10000        1444          112 2020-03-16 20:00:00     Tarjeta

[10000 rows x 5 columns]

TABLA DETALLE_ORDEN

In [10]:
productos = df_productos["id_producto"]
ordenes = df_ordenes["id_cliente"]

detalle_ordenes = []
for orden in ordenes:
    for num in range (1, 15):
        producto = int(random.choice(productos))
        cantidad = random.randint(1, 20)
        precio = float(round(df_productos["precio"][df_productos["id_producto"] == producto].iloc[0]))
        descuento = float(round(random.uniform(0, 5.0), 2))
        detalle_ordenes.append([orden, producto, cantidad, precio, descuento, ])
    
df_detalle_ordenes = pd.DataFrame(detalle_ordenes, columns=["id_orden", "id_producto", "cantidad", "precio_unitario", "descuento"])
df_detalle_ordenes = df_detalle_ordenes.reset_index().rename({'index': "id_detalle_ordenes"}, axis=1)
df_detalle_ordenes['id_orden'] = df_detalle_ordenes['id_detalle_ordenes'] + 1
df_detalle_ordenes

,id_detalle_ordenes,id_orden,id_producto,cantidad,precio_unitario,descuento
0,0,1,25,20,9.0,2.50
1,1,2,18,10,17.0,2.20
2,2,3,29,9,8.0,4.92
3,3,4,12,16,3.0,3.58
4,4,5,36,16,6.0,3.75
...,...,...,...,...,...,...
139995,139995,139996,11,13,19.0,4.23
139996,139996,139997,30,20,15.0,2.30
139997,139997,139998,24,4,17.0,0.20
139998,139998,139999,34,2,11.0,4.50
139999,139999,140000,5,19,5.0,3.30

CONEXIÓN

In [11]:
user = "root"
password = "admin"
database = "supermercado"
engine = create_engine(f"mysql+pymysql://{user}:{password}@localhost:3306/{database}")
connection.close()

CARGA DE DATOS EN MYSQL

In [12]:
df_tiendas.to_sql("tiendas", con= engine, if_exists="append", index= False)
df_empleados.to_sql("empleados", con= engine, if_exists="append", index= False)
df_categorias.to_sql("categorias", con= engine, if_exists="append", index= False)
df_productos.to_sql("productos", con= engine, if_exists="append", index= False)
df_clientes.to_sql("clientes", con= engine, if_exists="append", index= False)
df_ordenes.to_sql("ordenes", con= engine, if_exists="append", index= False)
df_detalle_ordenes.to_sql("detalle_ordenes", con= engine, if_exists="append", index= False)

140000

##### 3. Consultas SQL

1. Listado de órdenes con detalles de cliente y empleado
    
    
    Muestra el ID de la orden, la fecha, el nombre del cliente, el nombre del empleado que asistió a la compra y el método de pago.
    Utiliza un JOIN entre las tablas de pedidos, clientes y empleados.

In [13]:
sql = """

SELECT 
    ordenes.id_orden AS id_orden,
    ordenes.fecha_orden AS fecha_orden,
    CONCAT(clientes.first_name, ' ', clientes.last_name) AS nombre_cliente,
    empleados.nombre_empleado AS nombre_empleado,
    ordenes.metodo_pago AS metodo_pago
FROM 
    ordenes
JOIN 
    clientes ON ordenes.id_cliente = clientes.id_cliente
JOIN 
    empleados ON ordenes.id_empleado = empleados.id_empleado;
"""
df = pd.read_sql(sql, engine)
df

,id_orden,fecha_orden,nombre_cliente,nombre_empleado,metodo_pago
0,2786,2020-01-26 17:40:00,Carlos Anguita,Rocío Armenteros,Tarjeta
1,2216,2020-01-22 18:40:00,Carlos Anguita,Fátima Morillas,Efectivo
2,2192,2020-01-22 14:40:00,Carlos Anguita,Hugo Morillas,Efectivo
3,1090,2020-01-14 23:00:00,Carlos Anguita,Marcos González,Efectivo
4,562,2020-01-11 07:00:00,Carlos Anguita,María Arjona,Efectivo
...,...,...,...,...,...
9995,5641,2020-02-15 13:30:00,Marcos Ramírez,Carlos García,Efectivo
9996,3730,2020-02-02 07:00:00,Marcos Ramírez,Manuel Cazalla,Tarjeta
9997,3705,2020-02-02 02:50:00,Marcos Ramírez,María Estévez,Efectivo
9998,9892,2020-03-16 02:00:00,Izan Ramírez,Hugo Pérez,Efectivo
9999,8142,2020-03-03 22:20:00,Izan Ramírez,Fátima Anguita,Efectivo

2. Productos con stock bajo


    Filtra aquellos productos cuyo stock sea menor a 10.
    Muestra nombre del producto, categoría y stock.

In [14]:
sql = """
SELECT 
    productos.nombre_producto AS nombre_producto,
    categorias.nombre_categoria AS categoria,
    productos.existencias AS existencias
FROM 
    productos
JOIN 
    categorias ON productos.id_categoria = categorias.id_categoria
WHERE 
    productos.existencias < 10;
"""
df = pd.read_sql(sql, engine)
df

  nombre_producto   categoria  existencias
0            Pavo  Carnicería            4

3. Ventas totales por categoría


    Muestra el nombre de la categoría y la suma total de las ventas (ej.: multiplicando cantidad * precio_unitario) para cada categoría.
    Realiza el JOIN con detalle_orden, productos y categorías.
    Utilización de agrupación (GROUP BY).

In [19]:
sql = """
SELECT 
    categorias.nombre_categoria AS nombre_categoria,
    SUM(detalle_ordenes.cantidad * detalle_ordenes.precio_unitario) AS total_ventas
FROM 
    detalle_ordenes
JOIN 
    productos ON detalle_ordenes.id_producto = productos.id_producto
JOIN 
    categorias ON productos.id_categoria = categorias.id_categoria
GROUP BY 
    categorias.nombre_categoria;
"""
df = pd.read_sql(sql, engine)
df

  nombre_categoria  total_ventas
0      Charcutería     1228361.0
1          Lácteos     2088500.0
2       Aperitivos     1521439.0
3       Carnicería     1692372.0
4       Congelados     1329019.0
5         Frutería     1367574.0
6       Pescadería     1535219.0
7        Panadería     1405858.0
8          Bebidas     1627301.0
9        Droguería     1260514.0

4. Clientes con mayores gastos acumulados


    Muestra el nombre del cliente y el monto total que ha gastado (suma de todas sus órdenes).
    Asegúrese de tener en cuenta posibles descuentos (descuento) si se ha definido. Por ejemplo, la fórmula podría ser (cantidad * precio_unitario) - descuento.
    Ordena el resultado de mayor a menor gasto acumulado.

In [20]:
sql = """
SELECT 
    clientes.first_name AS nombre_cliente,
    SUM((detalle_ordenes.cantidad * detalle_ordenes.precio_unitario)- detalle_ordenes.descuento) AS gasto_total_descuento,
    SUM(detalle_ordenes.cantidad * detalle_ordenes.precio_unitario) AS gasto_total_Sin_Descuento
FROM 
    Clientes 
JOIN 
    Ordenes  ON clientes.id_cliente = ordenes.id_cliente
JOIN 
    detalle_ordenes ON ordenes.id_orden = detalle_ordenes.id_orden
GROUP BY 
    clientes.first_name
ORDER BY 
    gasto_total_Sin_Descuento DESC;
"""
df = pd.read_sql(sql, engine)
df

   nombre_cliente  gasto_total_descuento  gasto_total_Sin_Descuento
0          Daniel               64953.10                    66548.0
1       Francisco               61265.70                    62626.0
2          Mónica               59390.51                    60870.0
3          Manuel               56991.50                    58286.0
4           Lucía               55292.17                    56534.0
5           Rocío               55111.25                    56365.0
6            Hugo               55082.97                    56359.0
7          Marcos               53743.82                    54967.0
8           María               53690.98                    54926.0
9            Rosa               52816.81                    54142.0
10          Diego               52877.25                    54069.0
11        Antonio               51055.14                    52229.0
12         Carlos               49664.77                    50899.0
13         Carmen               49107.86                    50380.0
14         Noelia               48893.50                    50118.0
15        Carmela               48197.21                    49337.0
16           Izan               45879.94                    46998.0
17        Natalia               45468.80                    46565.0
18         Javier               44857.69                    46010.0
19         Fátima               43918.13                    45052.0

5. Empleados y número de órdenes gestionadas


    Muestra el nombre del empleado, el puesto y la cantidad de órdenes que ha gestionado.
    Utilice GROUP BY y COUNT.

In [17]:
sql = """
SELECT 
	empleados.nombre_empleado,
    empleados.puesto,
    count(ordenes.id_orden) AS ordenes_gestionadas
FROM 
    empleados
JOIN 
    ordenes ON empleados.id_empleado = ordenes.id_empleado
GROUP BY 
    empleados.id_empleado, empleados.nombre_empleado, empleados.puesto
ORDER BY 
    ordenes_gestionadas DESC;
"""
df = pd.read_sql(sql, engine)
df

      nombre_empleado     puesto  ordenes_gestionadas
0     Diego Montijano     Cajero                   84
1    María Armenteros   Vendedor                   83
2      Carmela Mantas   Limpieza                   80
3       Natalia Pérez  Reponedor                   80
4      Noelia Montiel   Vendedor                   78
..                ...        ...                  ...
155      Daniel Pérez     Cajero                   48
156   Antonio Estévez   Limpieza                   48
157     Carmen Ortega     Cajero                   47
158  Francisco Arjona  Reponedor                   47
159     Antonio López  Reponedor                   46

[160 rows x 3 columns]

6. Ordenes filtradas por fecha y tienda


    Muestra todas las órdenes que se realizaron en un rango de fechas determinadas (ej.: del 1 de enero de 2025 al 31 de enero de 2025) y en una tienda específica.
    Incluye datos de la tienda y del cliente.

In [18]:
sql = """ 
SELECT 
	ordenes.id_orden,
    ordenes.fecha_orden,
    tiendas.nombre_tienda,
    tiendas.direccion AS ubicacion_tienda,
    clientes.first_name,
    clientes.email
FROM 
    ordenes
JOIN 
    tiendas ON tiendas.id_tienda = tiendas.id_tienda
JOIN
	clientes ON ordenes.id_cliente = clientes.id_cliente
WHERE 
    ordenes.fecha_orden BETWEEN '2020-01-07' AND '2020-01-31'
ORDER BY 
    ordenes.fecha_orden ASC;
"""
df = pd.read_sql(sql, engine)
df

,id_orden,fecha_orden,nombre_tienda,ubicacion_tienda,first_name,email
0,1,2020-01-07 09:30:00,Super1,"Calle Vicente Ferrer, Nº21",Fátima,"FátimaOrtega['@gmail.com', '@hotmail.com', '@o..."
1,1,2020-01-07 09:30:00,Super2,"Plaza Einstein, Nº6",Fátima,"FátimaOrtega['@gmail.com', '@hotmail.com', '@o..."
2,1,2020-01-07 09:30:00,Super3,"Calle Parras, Nº15",Fátima,"FátimaOrtega['@gmail.com', '@hotmail.com', '@o..."
3,1,2020-01-07 09:30:00,Super4,"Calle Linares, Nº12",Fátima,"FátimaOrtega['@gmail.com', '@hotmail.com', '@o..."
4,1,2020-01-07 09:30:00,Super5,"Plaza Constitución, Nº29",Fátima,"FátimaOrtega['@gmail.com', '@hotmail.com', '@o..."
...,...,...,...,...,...,...
27195,3400,2020-01-31 00:00:00,Super4,"Calle Linares, Nº12",Lucía,"LucíaAnguita['@gmail.com', '@hotmail.com', '@o..."
27196,3400,2020-01-31 00:00:00,Super5,"Plaza Constitución, Nº29",Lucía,"LucíaAnguita['@gmail.com', '@hotmail.com', '@o..."
27197,3400,2020-01-31 00:00:00,Super6,"Avenida Europa, Nº18",Lucía,"LucíaAnguita['@gmail.com', '@hotmail.com', '@o..."
27198,3400,2020-01-31 00:00:00,Super7,"Avenida Deportes, Nº11",Lucía,"LucíaAnguita['@gmail.com', '@hotmail.com', '@o..."
27199,3400,2020-01-31 00:00:00,Super8,"Calle Elvira, Nº30",Lucía,"LucíaAnguita['@gmail.com', '@hotmail.com', '@o..."